notes/codings.org
*** Notation
    a Notation \(n\), specifies the form of the role, and can be one of:
    - English :: \triangleq Human language to give explanations/statements.
    - Diagram :: \triangleq Diagram in the manner of data structures, such as graph, list.
    - List :: \triangleq List of similar items
    - OrderedList :: \triangleq Step by step items
    - Math :: \triangleq Formulas/math style symbols.
    - Pseudocode :: \triangleq Algorithm presented as pseudocode
    - Code :: \triangleq executable code to show the algorithm explicitly
    - Table :: \triangleq Explanatory information displayed in a table
    - Animation :: \triangleq a gif or animation of any type is used.
    - Picture :: \triangleq A photo/screenshot or picture is used.
    - Sequence :: \triangleq A conjunction of steps meant to show progress in a serial manner
    - Plot :: \triangleq A mathematically generated plot that adheres to some coordinate system

    for example a definition might be described in English, followed by the same
    definition described by geometry. Notations can be combined for a single
    location like so:
    \begin{equation}
       \(\frac{n \in \text{Notation} \quad m \in \text{Notation}}{n/m \in \text{Notation}}\)
    \end{equation}

* Typology with following Bellack et al.

** Disclaimer
   Make sure you are comfortable with the terminology of Bellack et al's typology. I will be referring to it throughout this document and assume the reader is familiar. If you don't know what I mean by Substantive-logical Meanings then go read the Theory Primer document.

** Strategy
   Merging our typology with Bellack et al's is tricky but doable. In general we will be adding some categories to the "Types of Pedagogical Moves", adding one category to "Substantive-Logical Meanings" and changing the "Speaker" category to a "slide number or page number". Lastly, there is an important design decision that I am making here in which /for each algorithm, we will now be forced to define substantive meanings/. Furthermore, I am going to completely remove the last 3 indices in Bellack's typology. These mostly deal with in class instructional phrases which are completely useless for our purposes.

** Syntax, Grammar, Terms
*** Terms
    We will follow with Bellack as close as possible as long as it suits our needs, so a pedagogical move has the form:
     \begin{verbatim}
     Move = 1. Line Number or Slide Number
            / 2. Type of Move 
            / 3. Substantive Meaning
            / 4. Substantive-Logical Meanings 
            / 5. Number of Lines in (3) or (4) 
     \end{verbatim}
*** Semantics of Moves

     1. *Line Number or Slide Number* \triangleq Indicates the source of the statement:
     2. *Type of Pedagogical Move* \triangleq reference to function of move, there are 2 types each with sub-types:
        1. Initiatory Moves
           1. /Structuring/ (STR) \triangleq sets context for subsequent behavior by launching or halting-excluding interaction.
           2. /Soliciting/ (SOL) \triangleq directly elicits a verbal, physical, or mental response; coded in terms of response expected. 
       2. Detailing Moves
          1. /Responding/ (RES) \triangleq fulfills expectation of solicitation; bears reciprocal relation only to solicitation. 
          2. /Expositing/ (EXP) \triangleq a move that explicitly provides or introduces further or new information 
       3. /Not Codable/ (NOC) \triangleq serves as the \perp in their coding scheme.
     3. *Substantive Meaning* \triangleq reference to a subject matter topic 
     4. *Substantive-Logical Meaning* \triangleq reference to cognitive process involved in dealing with subject matter under study. 3 Main Types each with subtypes:
        1. Analytic Process \triangleq Use of language or established rules of logic
           1. /Definining-Denotative/ (DED) \triangleq object referent of term 
           2. /Defining-Connotative/ (DEC) \triangleq defining characteristics of class or term
           3. /Defining-Definitive/ (DEF) \triangleq to give the defining characteristic of a /class and/ to give a specific example of an item with that class
           3. /Interpreting/ (INT) \triangleq verbal equivalent of a statement, slogan, aphorism, or proverb
        2. Empirical Process \triangleq sense experience as criterion of truth
           1. /Fact-Stating/ (FAC) \triangleq what is, was, or will be without explanation or evaluation.
           2. /Explaining/ (XPL) \triangleq relation between objects, events, principles, conditional inference, cause-effect, explicit comparison-contrast, statement of principles, theories or laws
        3. Evaluative Process \triangleq set of criteria or value system as basis for verification
           1. /Opining/ (OPN) \triangleq personal values for statement of policy, judgment or evaluation of event, idea, state of affairs, direct and indirect evaluation included
           2. /Justifying/ (JUS) \triangleq reasons or argument for or against opinion or judgment
        4. Visual Process \triangleq a visual representation is provided and discussed
        5. /Logical Process Not Clear/ (NCL) \triangleq this serves as \perp for Substantive-Logical Meanings
     5. *Number of Lines in 3 and 4 above* 
    
*** Syntax
    We will follow Bellack's syntax as well:
**** The / Operator:
     The moves constituents are syntactically conjoined, /in order/, into strings with the "/" operator like so: \\
     \begin{equation}
        \(\frac{n \in \text{Move Constituents} \quad m \in \text{Move Constituents}}{n/m \in \text{Partial Move}}\)
     \end{equation}
   
**** An Example
     coded pedagogical move is: \\
     \begin{verbatim}
       2/STR/MOT/IMX/2
     \end{verbatim}

     The interpretation is as follows:
     \begin{verbatim}
       2 / STR / MOT / IMX /  2
      (1)/ (2) / (3) / (4) / (5)
     \end{verbatim}

     This translates to: On slide 2 (1), the presentation makes a /structuring/ (2) move in which it /explains/ (4) the /motivation/ (3) for something for /two/ (5) slides

     Here is Bellack et al's example for reference:
     \begin{verbatim}
       T/STR/IMX/XPL/4/PRC/FAC/2
     \end{verbatim}
     The interpretation is as follows:
     \begin{verbatim}
       T / STR / IMX / XPL /  4  / PRC / FAC / 2
      (1)/ (2) / (3) / (4) / (5) / (6) / (7) /(8)
     \end{verbatim}
     This translates to: A /teacher/ (1) makes a /structuring/ (2) move in which they /explain/ (4) something about  /imports and exports/ (3) for /four/ (5) lines of transcript and also states /facts/ (7) about class /procedures/ (6) for /two/ (8) lines of the transcript. 

     Here is a useful way to think of this (if you haven't read the Theory primer and skipped my warning!):
     \begin{verbatim}
       Place of Move / Turn in Language Game / Subject of the Move / How the Move is talking about it
             (1)     /        (2)           /            (3)       /            (4)                 
     \end{verbatim}

