notes/codings.tex

\subsubsection*{Notation}
\label{sec:orge065711}
a Notation \(n\), specifies the form of the role, and can be one of:
\begin{description}
\item[{English}] \(\triangleq\) Human language to give explanations/statements.
\item[{Diagram}] \(\triangleq\) Diagram in the manner of data structures, such as graph, list.
\item[{List}] \(\triangleq\) List of similar items
\item[{OrderedList}] \(\triangleq\) Step by step items
\item[{Math}] \(\triangleq\) Formulas/math style symbols.
\item[{Pseudocode}] \(\triangleq\) Algorithm presented as pseudocode
\item[{Code}] \(\triangleq\) executable code to show the algorithm explicitly
\item[{Table}] \(\triangleq\) Explanatory information displayed in a table
\item[{Animation}] \(\triangleq\) a gif or animation of any type is used.
\item[{Picture}] \(\triangleq\) A photo/screenshot or picture is used.
\item[{Sequence}] \(\triangleq\) A conjunction of steps meant to show progress in a serial manner
\item[{Plot}] \(\triangleq\) A mathematically generated plot that adheres to some coordinate system
\end{description}

for example a definition might be described in English, followed by the same
definition described by geometry. Notations can be combined for a single
location like so:
\begin{equation}
   \(\frac{n \in \text{Notation} \quad m \in \text{Notation}}{n/m \in \text{Notation}}\)
\end{equation}

\section*{Typology with following Bellack et al.}
\label{sec:orgae6911c}

\subsection*{Disclaimer}
\label{sec:org9eb4349}
Make sure you are comfortable with the terminology of Bellack et al's typology. I will be referring to it throughout this document and assume the reader is familiar. If you don't know what I mean by Substantive-logical Meanings then go read the Theory Primer document.

\subsection*{Strategy}
\label{sec:org527f03d}
Merging our typology with Bellack et al's is tricky but doable. In general we will be adding some categories to the "Types of Pedagogical Moves", adding one category to "Substantive-Logical Meanings" and changing the "Speaker" category to a "slide number or page number". Lastly, there is an important design decision that I am making here in which \emph{for each algorithm, we will now be forced to define substantive meanings}. Furthermore, I am going to completely remove the last 3 indices in Bellack's typology. These mostly deal with in class instructional phrases which are completely useless for our purposes.

\subsection*{Syntax, Grammar, Terms}
\label{sec:orgc7994b8}
\subsubsection*{Terms}
\label{sec:orgcc9fa38}
We will follow with Bellack as close as possible as long as it suits our needs, so a pedagogical move has the form:
\begin{verbatim}
Move = 1. Line Number or Slide Number
       / 2. Type of Move 
       / 3. Substantive Meaning
       / 4. Substantive-Logical Meanings 
       / 5. Number of Lines in (3) or (4) 
\end{verbatim}
\subsubsection*{Semantics of Moves}
\label{sec:orgd751d63}

\begin{enumerate}
\item \textbf{Line Number or Slide Number} \(\triangleq\) Indicates the source of the statement:
\item \textbf{Type of Pedagogical Move} \(\triangleq\) reference to function of move, there are 2 types each with sub-types:
\begin{enumerate}
\item Initiatory Moves
\begin{enumerate}
\item \emph{Structuring} (STR) \(\triangleq\) sets context for subsequent behavior by launching or halting-excluding interaction.
\item \emph{Soliciting} (SOL) \(\triangleq\) directly elicits a verbal, physical, or mental response; coded in terms of response expected.
\end{enumerate}
\end{enumerate}
\begin{enumerate}
\item Detailing Moves
\begin{enumerate}
\item \emph{Responding} (RES) \(\triangleq\) fulfills expectation of solicitation; bears reciprocal relation only to solicitation.
\item \emph{Expositing} (EXP) \(\triangleq\) a move that explicitly provides or introduces further or new information
\end{enumerate}
\item \emph{Not Codable} (NOC) \(\triangleq\) serves as the \(\perp\) in their coding scheme.
\end{enumerate}
\item \textbf{Substantive Meaning} \(\triangleq\) reference to a subject matter topic
\item \textbf{Substantive-Logical Meaning} \(\triangleq\) reference to cognitive process involved in dealing with subject matter under study. 3 Main Types each with subtypes:
\begin{enumerate}
\item Analytic Process \(\triangleq\) Use of language or established rules of logic
\begin{enumerate}
\item \emph{Definining-Denotative} (DED) \(\triangleq\) object referent of term
\item \emph{Defining-Connotative} (DEC) \(\triangleq\) defining characteristics of class or term
\item \emph{Defining-Definitive} (DEF) \(\triangleq\) to give the defining characteristic of a \emph{class and} to give a specific example of an item with that class
\item \emph{Interpreting} (INT) \(\triangleq\) verbal equivalent of a statement, slogan, aphorism, or proverb
\end{enumerate}
\item Empirical Process \(\triangleq\) sense experience as criterion of truth
\begin{enumerate}
\item \emph{Fact-Stating} (FAC) \(\triangleq\) what is, was, or will be without explanation or evaluation.
\item \emph{Explaining} (XPL) \(\triangleq\) relation between objects, events, principles, conditional inference, cause-effect, explicit comparison-contrast, statement of principles, theories or laws
\end{enumerate}
\item Evaluative Process \(\triangleq\) set of criteria or value system as basis for verification
\begin{enumerate}
\item \emph{Opining} (OPN) \(\triangleq\) personal values for statement of policy, judgment or evaluation of event, idea, state of affairs, direct and indirect evaluation included
\item \emph{Justifying} (JUS) \(\triangleq\) reasons or argument for or against opinion or judgment
\end{enumerate}
\item Visual Process \(\triangleq\) a visual representation is provided and discussed
\item \emph{Logical Process Not Clear} (NCL) \(\triangleq\) this serves as \(\perp\) for Substantive-Logical Meanings
\end{enumerate}
\item \textbf{Number of Lines in 3 and 4 above}
\end{enumerate}

\subsubsection*{Syntax}
\label{sec:org37c9ed3}
We will follow Bellack's syntax as well:
\begin{itemize}
\item The / Operator:
\label{sec:orgfd0af08}
The moves constituents are syntactically conjoined, \emph{in order}, into strings with the "/" operator like so: \\
\begin{equation}
   \(\frac{n \in \text{Move Constituents} \quad m \in \text{Move Constituents}}{n/m \in \text{Partial Move}}\)
\end{equation}

\item An Example
\label{sec:orgf4f0f6e}
coded pedagogical move is: \\
\begin{verbatim}
  2/STR/MOT/IMX/2
\end{verbatim}

The interpretation is as follows:
\begin{verbatim}
  2 / STR / MOT / IMX /  2
 (1)/ (2) / (3) / (4) / (5)
\end{verbatim}

This translates to: On slide 2 (1), the presentation makes a \emph{structuring} (2) move in which it \emph{explains} (4) the \emph{motivation} (3) for something for \emph{two} (5) slides

Here is Bellack et al's example for reference:
\begin{verbatim}
  T/STR/IMX/XPL/4/PRC/FAC/2
\end{verbatim}
The interpretation is as follows:
\begin{verbatim}
  T / STR / IMX / XPL /  4  / PRC / FAC / 2
 (1)/ (2) / (3) / (4) / (5) / (6) / (7) /(8)
\end{verbatim}
This translates to: A \emph{teacher} (1) makes a \emph{structuring} (2) move in which they \emph{explain} (4) something about  \emph{imports and exports} (3) for \emph{four} (5) lines of transcript and also states \emph{facts} (7) about class \emph{procedures} (6) for \emph{two} (8) lines of the transcript. 

Here is a useful way to think of this (if you haven't read the Theory primer and skipped my warning!):
\begin{verbatim}
  Place of Move / Turn in Language Game / Subject of the Move / How the Move is talking about it
        (1)     /        (2)           /            (3)       /            (4)                 
\end{verbatim}
\end{itemize}
