notes/codings.tex

\subsection*{Differences}
\label{sec:orgb738125}
There are only a few slight differences between this typology and Bellacks:
\begin{enumerate}
\item I've added Types of Pedagogical Moves that are useful for powerpoint slides or lecture notes and removed the reacting type because one cannot react in the same sense to lecture notes or powerpoint slides
\item I've removed the last three categories, see strategy for why
\item I've added \emph{Visual Moves} and \emph{Visual Processes} to the type of moves and the substantive-logical meanings respectively. More discussion on this in number (2) in Caveats and Design Decisions below
\item I've altered the Speaker category to be the location of the move in the document.
\end{enumerate}

\subsection*{Caveats and Design Decisions}
\label{sec:orga886580}
For the most part Bellack's system is useful to our needs. There are some important aspects to consider though:
\begin{enumerate}
\item We have risen a level of abstraction: In our original Typology we could count the number of proofs or the number of examples. In this revised typology we \emph{can only} state the types and frequencies of pedagogical moves. This means that if you want to know how many pictures there are in a document then this system will fail you. Rather we would be able to say that the document 1) uses visual aids and 2) has a teaching cycle like STR EXP VIS in that the document cycles a Structuring move, then an Expository move, and then has a Visual move to wrap up.
\item Where should Visual moves information be? In the revised typology I've added Visual moves to the "Types of Pedagogical Moves" I did this because this category is based on Wittgenstein's concept of a language game. So in Bellack's typology it made sense that they would have a Soliciting move, a Responding move, and a Reacting move because they were analyzing lectures in the classroom. In our typology it makes no sense because we are analyzing a different type of communication viz. power points and lecture notes. So we need to add a few. But that leads to the curious case of Visual Moves. There are both slides that are of a visual type and slides that discuss something using visual notations e.g. pictures or cartoons, so it seems that Visual information is \emph{both a Type of Move, and a Substantive-Logical Meaning}. Recall that \emph{Substantive-Logical Meanings} is the category that denotes the cognitive process involved in dealing with the subject being discussed so we are saying that for power points or maybe lecture notes there are cognitive visual processes occurring.
\item The last major design decision I made here regards the 3 category, namely \emph{Substantive Meaning}. In Bellack's typology they use this category to be specific about what exactly is being discussed in relation to the overall topic. So for them, the overall topic could be international trade, and then the specifics would be trade tariffs or trade groups. For us the overall topic would be "Dijkstra's Algorithm" or "AVL Trees" and then the specifics could be "Motivation for the algorithm", "Applications of the algorithm", "implementation details of the algorithm". Or we could be even more specific and say the specifics are "Priority Queues" for Dijkstra's and "Tree Rotation" or "Tree Balancing" for AVL Trees. This sort of system is powerful, and more adaptable than our previous notation in that it \emph{does not} seek to provide global, transcendent categories for \emph{every} algorithm. Rather it allows us to \emph{define} the specific attributes for each algorithm and add that information to the typology. This may be or may not be desirable and we should have a lengthy discussion about it at some point because I'm not sure exactly what the implications are or are not.
\end{enumerate}
\end{document}